package AbstractHeroes;

public enum NamesHeroes {
    Кирилл, Владимир, Михаил, Дмитрий, Константин, Максим, Алексей, Лев, Вадим, Марк, Иван, Евгений,
    Владислав, Егор, Артём, Илья, Семён, Андрей, Богдан, Ярослав, Даниил, Григорий, Фёдор, Герман,
    Тимур, Тимофей, Степан, Александр, Глеб, Павел, Ян, Макар, Юрий, Пётр, Игорь, Руслан, Матвей,
    Марсель, Роман, Сергей, Савелий, Леонид, Артемий, Мирон, Никита, Данила, Антон, Родион, Мартин,
    Денис, Всеволод, Тигран, Адам, Артур, Ибрагим, Арсений, Лука, Николай, Георгий, Олег, Вячеслав,
    Филипп, Данил, Даниэль, Тихон, Гордей, Станислав, Савва, Виктор, Платон, Давид, Василий, Дамир,
    Роберт, Эмир, Эмиль, Мирослав, Захар, Святослав, Яков, Елисей, Али, Борис, Аркадий, Альберт, Эрик,
    Серафим, Демьян, Валерий, Стефан, Демид, Леон, Арсен, Марат, Камиль, Виталий, Анатолий, Адриан,
    Карим, Ростислав,

    Агата, Алиса, Дарья, Арина, Мария, Дина, Виктория, Анна, Василиса, Елизавета, Татьяна, Злата,
    Александра, Яна, Оливия, Полина, Ольга, Ксения, Диана, Агния, София, Амина, Анастасия, Маргарита,
    Есения, Вероника, Стефания, Пелагея, Екатерина, Софья, Валерия, Кристина, Таисия, Алина, Милана,
    Каролина, Варвара, Ева, Ярослава, Марьям, Эмилия, Марта, Аделина, Евгения, Надежда, Дарина, Амира,
    Ульяна, Зоя, Мия, Вера, Мирослава, Елена, Алёна, Кира, Ника, Юлия, Сабина, Марина, Мира, Камила,
    Ясмина, Алия, Аиша, Сафия, Светлана, Элина, Эвелина, Фатима, Ангелина, Майя, Серафима, Ирина,
    Теона, Малика, Лилия, Нина, Амелия, Анисия, Владислава, Мадина, Валентина, Антонина, Марианна,
    Николь, Лидия, Марьяна, Карина, Алисия, Регина, Лея, Мила, Аглая, Аврора, Любовь, Евдокия, Наталья,
    Амалия, Юлиана, Анфиса
}